lua/doc/MANUAL.org
#+TITLE:	Lua RTT bindings (beta1)
#+AUTHOR:	Markus Klotzbuecher
#+EMAIL:	markus.klotzbuecher@mech.kuleuven.be
#+DATE:		2010-09-13 Mon
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:	en
#+OPTIONS:	H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:	TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT:	view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+STYLE:	<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />

#+STARTUP:	showall
#+STARTUP:	hidestars

* Overview

  The RTT Lua bindings provide a slim but powerful interface to the
  RTT framework. It can be used for:

  - for building domain specific languages for the RTT
  - as a scriptable taskbrowser and deployer
  - for fast prototyping of components

  These bindings can be used in three different ways:

   1. As a *RTT enabled Lua interpreter*

      This is the easiest way to test a script and see if it works or
      for use as a scriptable deployer.

   2. As a *Lua component*

      A Lua component which offers two operations. The first for
      executing a given lua script and the second for executing a
      string with lua code.

   3. As a *RTT plugin*

      A /Lua Service/ can be loaded into a component and used e.g. for
      /intra-component/ coordination. It offers the same API as the
      Lua component.

* Setup
** Compilation

   - requires Lua-5.1 (debian: =liblua5.1-0-dev=, =liblua5.1-0=, =lua5.1=)

   - CMake options:
     - =
     -

** Runtime

    - setup =LUA_PATH= and =LUA_CPATH= so that the necessary modules
      are found. The former is for lua modules (.lua) and the later is
      for binary ones (.so). For example:

#+BEGIN_EXAMPLE
      $ export LUA_PATH=";;;/usr/share/lua/5.1/?.lua;\
	      /usr/share/lua/5.1/?/init.lua;\
	      /home/mk/src/git/orocos/ocl/lua/modules/?.lua"
#+END_EXAMPLE

    - if using =rttlua= scripting: export correct =RTT_COMPONENT_PATH=
      variable, e.g.

#+BEGIN_EXAMPLE
      $ export RTT_COMPONENT_PATH=/home/mk/tmp/rtt-2.0/lib/orocos:home/mk/src/git/ocl/lua
#+END_EXAMPLE

* Quickstart

  Run the =rttlua= interpreter:

#+BEGIN_EXAMPLE
  ./rttlua
  Orocos RTTLua 1.0-beta1 (gnulinux)
  > -- get a reference to our "this" TaskContext
  > TC = rtt.getTC()
  > -- print the TaskContext
  > print(TC)
  userdata: 0x1cba0b8
  > -- if we want nicer output we must load the rttlib module
  > require("modules/rttlib")
  > print(TC)
  TaskContext: lua
  state: PreOperational
  [...]
  > -- enable colors
  > rttlib.color=true
  > print(TC)
  > -- get deployer peer. Lua methods are called with ':' notation
  > d = TC:getPeer("deployer")
  > print(d)
  > instead of print you can just type '='
  > =d
  > -- call an operation
  > d:call("displayComponentTypes")
  I can create the following component types:
     OCL::LuaComponent
     OCL::Testcomp
  >

#+END_EXAMPLE
* Using the LuaComponent

  see the simple producer comsumer example in the
  =scripts/producer_consumer/= directory.

* Using the LuaService

  Here's an example which creates a Lua service in the deployer
  component.

#+BEGIN_EXAMPLE
  ./rttlua
  Orocos RTTLua 1.0-beta1 (gnulinux)
  > todo

#+END_EXAMPLE

* Lua API

