lua/doc/MANUAL.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Lua RTT bindings (beta1)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-09-13 Mon"/>
<meta name="author" content="Markus Klotzbuecher"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">

<h1 class="title">Lua RTT bindings (beta1)</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview </a></li>
<li><a href="#sec-2">2 Setup </a>
<ul>
<li><a href="#sec-2_1">2.1 Compilation </a></li>
<li><a href="#sec-2_2">2.2 Runtime </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Quickstart </a></li>
<li><a href="#sec-4">4 Using the LuaComponent </a></li>
<li><a href="#sec-5">5 Using the LuaService </a></li>
<li><a href="#sec-6">6 Lua API </a>
<ul>
<li><a href="#sec-6_1">6.1 Overview </a></li>
<li><a href="#sec-6_2">6.2 TaskContext </a></li>
<li><a href="#sec-6_3">6.3 SendHandle </a></li>
<li><a href="#sec-6_4">6.4 Variable </a></li>
<li><a href="#sec-6_5">6.5 InputPort and OutputPort </a></li>
<li><a href="#sec-6_6">6.6 Property </a></li>
<li><a href="#sec-6_7">6.7 Service Interface </a>
<ul>
<li><a href="#sec-6_7_1">6.7.1 Service </a></li>
<li><a href="#sec-6_7_2">6.7.2 ServiceRequester </a></li>
<li><a href="#sec-6_7_3">6.7.3 Operation </a></li>
</ul>
</li>
<li><a href="#sec-6_8">6.8 Miscellaneous </a>
<ul>
<li><a href="#sec-6_8_1">6.8.1 Logger </a></li>
<li><a href="#sec-6_8_2">6.8.2 Service/Typekits/Types information </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 The rttlib convenience module </a>
<ul>
<li><a href="#sec-7_1">7.1 how to add a pretty printer for a custom type </a></li>
</ul>
</li>
<li><a href="#sec-8">8 Tips and tricks </a>
<ul>
<li><a href="#sec-8_1">8.1 rttlua init file <code>~/.rttlua</code> </a></li>
</ul>
</li>
<li><a href="#sec-9">9 Known issues </a>
<ul>
<li><a href="#sec-9_1">9.1 Assignment is not like RTT scripting </a></li>
<li><a href="#sec-9_2">9.2 Not all types are garbage collected </a></li>
<li><a href="#ComparisonIssue">9.3 Comparing Lua types and RTT Variables fails </a></li>
</ul>
</li>
<li><a href="#sec-10">10 Todo  </a></li>
<li><a href="#sec-11">11 License </a></li>
<li><a href="#sec-12">12 Links </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview </h2>
<div class="outline-text-2" id="text-1">


<p>
The RTT Lua bindings provide a slim but powerful interface to the
RTT framework. It can be used for:
</p>
<ul>
<li>
for building domain specific languages for the RTT
</li>
<li>
as a scriptable taskbrowser and deployer
</li>
<li>
for fast prototyping of components

</li>
</ul>

<p>These bindings can be used in three different ways:
</p>
<ol>
<li>
As a <b>RTT enabled Lua interpreter</b>

<p>
This is the easiest way to test a script and see if it works or
for use as a scriptable deployer.
</p>
</li>
<li>
As a <b>Lua component</b>

<p>
A Lua component which offers two operations. The first for
executing a given lua script and the second for executing a
string with lua code.
</p>
</li>
<li>
As a <b>RTT plugin</b>

<p>
A <i>Lua Service</i> can be loaded into a component and used e.g. for
<i>intra-component</i> coordination. It offers the same API as the
Lua component.
</p>
</li>
</ol>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Setup </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Compilation </h3>
<div class="outline-text-3" id="text-2_1">


<ul>
<li>
requires Lua-5.1 (debian: <code>liblua5.1-0-dev</code>, <code>liblua5.1-0</code>, <code>lua5.1</code>)

</li>
<li>
CMake options:
<ul>
<li>
=
</li>
</ul>

<p>-
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Runtime </h3>
<div class="outline-text-3" id="text-2_2">


<ul>
<li>
setup <code>LUA_PATH</code> and <code>LUA_CPATH</code> so that the necessary modules
are found. The former is for lua modules (.lua) and the later is
for binary ones (.so). For example:


</li>
</ul>


<pre class="example">$ export LUA_PATH=";;;/usr/share/lua/5.1/?.lua;\
        /usr/share/lua/5.1/?/init.lua;\
        /home/mk/src/git/orocos/ocl/lua/modules/?.lua"
</pre>



<ul>
<li>
if using <code>rttlua</code> scripting: export correct <code>RTT_COMPONENT_PATH</code>
variable, e.g.


</li>
</ul>


<pre class="example">$ export RTT_COMPONENT_PATH=/home/mk/tmp/rtt-2.0/lib/orocos:home/mk/src/git/ocl/lua
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Quickstart </h2>
<div class="outline-text-2" id="text-3">


<p>
Run the <code>rttlua</code> interpreter:
</p>



<pre class="example">./rttlua
Orocos RTTLua 1.0-beta1 (gnulinux)
&gt; -- get a reference to our "this" TaskContext
&gt; TC = rtt.getTC()
&gt; -- print the TaskContext
&gt; print(TC)
userdata: 0x1cba0b8
&gt; -- if we want nicer output we must load the rttlib module
&gt; require("modules/rttlib")
&gt; print(TC)
TaskContext: lua
state: PreOperational
[...]
&gt; -- enable colors
&gt; rttlib.color=true
&gt; print(TC)
&gt; -- get deployer peer. Lua methods are called with ':' notation
&gt; d = TC:getPeer("deployer")
&gt; print(d)
&gt; instead of print you can just type '='
&gt; =d
&gt; -- call an operation
&gt; d:call("displayComponentTypes")
I can create the following component types:
   OCL::LuaComponent
   OCL::Testcomp
&gt;

</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Using the LuaComponent </h2>
<div class="outline-text-2" id="text-4">


<p>
see the simple producer comsumer example in the
<code>scripts/producer_consumer/</code> directory.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Using the LuaService </h2>
<div class="outline-text-2" id="text-5">


<p>
Here's an example which creates a Lua service in the deployer
component.
</p>



<pre class="example">./rttlua
Orocos RTTLua 1.0-beta1 (gnulinux)
&gt; todo

</pre>



</div>

</div>
