lua/doc/MANUAL.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Lua API </h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> Overview </h3>
<div class="outline-text-3" id="text-6_1">


<p>
The Lua API consists of objects and free functions. The API naming
mostly follows that RTT while simplifying where possible. All rtt
related functions are stored in a global table called <code>rtt</code>. They
are further subdivided as followed:
</p>
<ul>
<li>
<code>TaskContext</code>
</li>
<li>
<code>SendHandle</code>
</li>
<li>
<code>Variable</code>
</li>
<li>
<code>InputPort</code> and <code>OutputPort</code>
</li>
<li>
<code>Property</code>
</li>
<li>
<code>Service</code>
</li>
<li>
<code>Operation</code>
</li>
<li>
<code>Logger</code>

</li>
</ul>

<p>Probably the most important function is <code>rtt.getTC()</code> which returns
a reference to <i>our</i> TaskContext.
</p>
<p>
<b>Note</b>: the API consists of what was needed so far and what was easy
to do. If something is missing which you need let us know. Chances
are high that it is easy to add.
</p>
<p>
Most of the API can be used in two ways: as functions and
objects. The first uses the dot '.' syntax and takes the object as
the first parameter. The second uses the ':' and will internally
pass the object as a first parameter.
</p>
<p>
For example the following two calls are equivalent:
</p>



<pre class="example">&gt; tc = rtt.getTC()
&gt; print( rtt.TaskContext.getName(tc) )
&gt; print( tc:getName() )
</pre>



<p>
The flag column describes additonal properties of the
function/method:
</p><ul>
<li>
'R': real-time safe
</li>
<li>
'F' or 'M': only available as function or method

</li>
</ul>
</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3">6.2</span> TaskContext </h3>
<div class="outline-text-3" id="text-6_2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>string getName()</code></td><td></td><td>returns TaskContext name</td></tr>
<tr><td><code>bool start()</code></td><td></td><td>start TaskContext</td></tr>
<tr><td><code>bool stop()</code></td><td></td><td>stop TaskContext</td></tr>
<tr><td><code>bool configure()</code></td><td></td><td>configure TaskContext</td></tr>
<tr><td><code>bool activate()</code></td><td></td><td>activate TaskContext</td></tr>
<tr><td><code>bool cleanup()</code></td><td></td><td>cleanup TaskContext</td></tr>
<tr><td><code>string getState()</code></td><td></td><td>return string describing current state</td></tr>
<tr><td><code>table getPeers()</code></td><td></td><td>return a table of all peers</td></tr>
<tr><td><code>void addPeer(TaskContext)</code></td><td></td><td>add a TaskContext as a peer</td></tr>
<tr><td><code>void removePeer(string)</code></td><td></td><td>remove a peer</td></tr>
<tr><td><code>TaskContext getPeer(string)</code></td><td></td><td>get a peer</td></tr>
<tr><td><code>table getPortNames()</code></td><td></td><td>return a table of port names</td></tr>
<tr><td><code>void addPort(port)</code></td><td></td><td>add a port to TaskContext</td></tr>
<tr><td><code>void addEventPort(port)</code></td><td></td><td>add a port as an event driven port</td></tr>
<tr><td><code>Port getPort(string)</code></td><td></td><td>get a port with given name</td></tr>
<tr><td><code>addProperty(Property)</code></td><td></td><td>add a property to TaskContext</td></tr>
<tr><td><code>getProperty(string)</code></td><td></td><td>get a property with the given name</td></tr>
<tr><td><code>table getProperties()</code></td><td></td><td>return all properties in a table</td></tr>
<tr><td><code>table getOps()</code></td><td></td><td>return a table of Operation names</td></tr>
<tr><td><code>string, number string, table getOpInfo(string)</code></td><td></td><td>returns name, arity, description and table of argument descriptions</td></tr>
<tr><td><code>Service provides(...)</code></td><td></td><td>return service (provides/0 default, provides/1 subservice)</td></tr>
<tr><td><code>Variable call(string, ...)</code></td><td></td><td>call operation with name specified by string and right arguments</td></tr>
<tr><td><code>SendHandle send(string, ...)</code></td><td></td><td>as above but send. returns SendHandle</td></tr>
<tr><td><code>void delete(TaskContext)</code></td><td></td><td>explicit deletion of a TaskContext</td></tr>
</tbody>
</table>



</div>

</div>
