lua/doc/MANUAL.txt

   The Lua API consists of objects and free functions. The API naming
   mostly follows that RTT while simplifying where possible. All rtt
   related functions are stored in a global table called =rtt=. They
   are further subdivided as followed:

   - =TaskContext=
   - =SendHandle=
   - =Variable=
   - =InputPort= and =OutputPort=
   - =Property=
   - =Service=
   - =Operation=
   - =Logger=

  Probably the most important function is =rtt.getTC()= which returns
  a reference to /our/ TaskContext.

  *Note*: the API consists of what was needed so far and what was easy
  to do. If something is missing which you need let us know. Chances
  are high that it is easy to add.

  Most of the API can be used in two ways: as functions and
  objects. The first uses the dot '.' syntax and takes the object as
  the first parameter. The second uses the ':' and will internally
  pass the object as a first parameter.

  For example the following two calls are equivalent:


  > tc = rtt.getTC()
  > print( rtt.TaskContext.getName(tc) )
  > print( tc:getName() )

  The flag column describes additonal properties of the
  function/method:
    - 'R': real-time safe
    - 'F' or 'M': only available as function or method

6.2 TaskContext 
================

     Method                                             flag   description                                                          
    --------------------------------------------------+------+---------------------------------------------------------------------
     =string getName()=                                        returns TaskContext name                                             
     =bool start()=                                            start TaskContext                                                    
     =bool stop()=                                             stop TaskContext                                                     
     =bool configure()=                                        configure TaskContext                                                
     =bool activate()=                                         activate TaskContext                                                 
     =bool cleanup()=                                          cleanup TaskContext                                                  
     =string getState()=                                       return string describing current state                               
     =table getPeers()=                                        return a table of all peers                                          
     =void addPeer(TaskContext)=                               add a TaskContext as a peer                                          
     =void removePeer(string)=                                 remove a peer                                                        
     =TaskContext getPeer(string)=                             get a peer                                                           
     =table getPortNames()=                                    return a table of port names                                         
     =void addPort(port)=                                      add a port to TaskContext                                            
     =void addEventPort(port)=                                 add a port as an event driven port                                   
     =Port getPort(string)=                                    get a port with given name                                           
     =addProperty(Property)=                                   add a property to TaskContext                                        
     =getProperty(string)=                                     get a property with the given name                                   
     =table getProperties()=                                   return all properties in a table                                     
     =table getOps()=                                          return a table of Operation names                                    
     =string, number string, table getOpInfo(string)=          returns name, arity, description and table of argument descriptions  
     =Service provides(...)=                                   return service (provides/0 default, provides/1 subservice)           
     =Variable call(string, ...)=                              call operation with name specified by string and right arguments     
     =SendHandle send(string, ...)=                            as above but send. returns SendHandle                                
     =void delete(TaskContext)=                                explicit deletion of a TaskContext                                   


6.3 SendHandle 
===============
