lua/doc/MANUAL.org
** SendHandle

   An object returned by a TaskContext send() operation.

   | Method                           | flag | description                                              |
   |----------------------------------+------+----------------------------------------------------------|
   | =string, variable collect()=     |      | collect results of send, may block. string is SendStatus |
   | =string, variable collectIfDone= |      | as above, non blocking version                           |

** Variable

   Variable are the types know to the RTT. They consist of basic types
   (numeric, =string=, =char=, =bool=) and user defined types. The
   function =rtt.Variable.getTypes()= returns a table of these types:

#+BEGIN_EXAMPLE
   > print(table.concat(rtt.Variable.getTypes(), ', '))
   ConnPolicy, FlowStatus, PropertyBag, SendHandle, SendStatus, array, bool, char, double, float, int, rt_string, string, uint, void
#+END_EXAMPLE


   | Method                            | flag | description                                                                 |
   |-----------------------------------+------+-----------------------------------------------------------------------------|
   | =variable new(type)=              | F    | create a new Variable of type                                               |
   | =variable new(type, ival)=        | F    | create new Variable of type and initialize with ival (only for basic types) |
   | =luaval tolua()=                  |      | convert to lua value (only for basic types)                                 |
   | =table getTypes()=                | F    | return a list of types know to the RTT                                      |
   | =string getType()=                |      | return the RTT type name in human readable format                           |
   | =string getTypeName()=            |      | return the RTT type name                                                    |
   | =table getMemberNames()=          |      | return a table of the names of subtypes of this variable                    |
   | =variable getMember(name)=        |      | return variable which is a member with name                                 |
   | =opBinary(string_op, var1, var2)= | F    | execute: var1 string_op var2                                                |
   | =bool assign(value)=              |      | assign value which can be a lua type or a Variable                          |
   |                                   |      |                                                                             |

   - the unary operator =-= and the binary operators =+=, =-=, =*=,
     =/= =%=, =^=, and the comparison operators '==', '<=', '>=' are
     supported. See the [[#ComparisonIssue][warning]] on comparing Variables with
     corresponding Lua types.

   - indexing and assigment

     Variables with members can be index and assigned. See the
     following example:

#+BEGIN_EXAMPLE
     > cp = rtt.Variable.new("ConnPolicy")
     > print(cp)
     {data_size=0,type=0,name_id="",init=false,pull=false,transport=0,lock_policy=2,size=0}
     > print(cp.data_size)
     0
     > cp.data_size = 4711
     > print(cp.data_size)
     4711
#+END_EXAMPLE

** InputPort and OutputPort

   InputPort

   | Method                    | flag | description                                                                  |
   |---------------------------+------+------------------------------------------------------------------------------|
   | =new(type)=               |      | create a new InputPort of type                                               |
   | =string, variable read()= |      | read from Port, returns a FlowStatus string and if data available a Variable |
   | =string read(variable)=   |      | read from Port and write result into Variable given. Returns FlowStatus      |
   | =table info()=            |      | return a table containing information about this port                        |
   | =delete()=                |      | delete this port (remove it from any TaskContext before this)          |

   OuputPort

   | Method            | flag | description                                                   |
   |-------------------+------+---------------------------------------------------------------|
   | =new(type)=       |      | create a new OutputPort of type                               |
   | =write(Variable)= |      | write Variable to port                                        |
   | =table info()=    |      | return a table containing information about this port         |
   | =delete()=        |      | delete this port (remove it from any TaskContext before this) |

