lua/doc/MANUAL.html

<div id="outline-container-6_3" class="outline-3">
<h3 id="sec-6_3"><span class="section-number-3">6.3</span> SendHandle </h3>
<div class="outline-text-3" id="text-6_3">


<p>
An object returned by a TaskContext send() operation.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>string, variable collect()</code></td><td></td><td>collect results of send, may block. string is SendStatus</td></tr>
<tr><td><code>string, variable collectIfDone</code></td><td></td><td>as above, non blocking version</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6_4" class="outline-3">
<h3 id="sec-6_4"><span class="section-number-3">6.4</span> Variable </h3>
<div class="outline-text-3" id="text-6_4">


<p>
Variable are the types know to the RTT. They consist of basic types
(numeric, <code>string</code>, <code>char</code>, <code>bool</code>) and user defined types. The
function <code>rtt.Variable.getTypes()</code> returns a table of these types:
</p>



<pre class="example">&gt; print(table.concat(rtt.Variable.getTypes(), ', '))
ConnPolicy, FlowStatus, PropertyBag, SendHandle, SendStatus, array, bool, char, double, float, int, rt_string, string, uint, void
</pre>




<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>variable new(type)</code></td><td>F</td><td>create a new Variable of type</td></tr>
<tr><td><code>variable new(type, ival)</code></td><td>F</td><td>create new Variable of type and initialize with ival (only for basic types)</td></tr>
<tr><td><code>luaval tolua()</code></td><td></td><td>convert to lua value (only for basic types)</td></tr>
<tr><td><code>table getTypes()</code></td><td>F</td><td>return a list of types know to the RTT</td></tr>
<tr><td><code>string getType()</code></td><td></td><td>return the RTT type name in human readable format</td></tr>
<tr><td><code>string getTypeName()</code></td><td></td><td>return the RTT type name</td></tr>
<tr><td><code>table getMemberNames()</code></td><td></td><td>return a table of the names of subtypes of this variable</td></tr>
<tr><td><code>variable getMember(name)</code></td><td></td><td>return variable which is a member with name</td></tr>
<tr><td><code>opBinary(string_op, var1, var2)</code></td><td>F</td><td>execute: var1 string<sub>op</sub> var2</td></tr>
<tr><td><code>bool assign(value)</code></td><td></td><td>assign value which can be a lua type or a Variable</td></tr>
</tbody>
</table>


<ul>
<li>
the unary operator <code>-</code> and the binary operators <code>+</code>, <code>-</code>, <code>*</code>,
<code>/</code> <code>%</code>, <code>^</code>, and the comparison operators '==', '&lt;=', '&gt;=' are
supported. See the <a href="#ComparisonIssue">warning</a> on comparing Variables with
corresponding Lua types.

</li>
<li>
indexing and assigment

<p>
Variables with members can be index and assigned. See the
following example:
</p>

</li>
</ul>


<pre class="example">&gt; cp = rtt.Variable.new("ConnPolicy")
&gt; print(cp)
{data_size=0,type=0,name_id="",init=false,pull=false,transport=0,lock_policy=2,size=0}
&gt; print(cp.data_size)
0
&gt; cp.data_size = 4711
&gt; print(cp.data_size)
4711
</pre>



</div>

</div>

<div id="outline-container-6_5" class="outline-3">
<h3 id="sec-6_5"><span class="section-number-3">6.5</span> InputPort and OutputPort </h3>
<div class="outline-text-3" id="text-6_5">


<p>
InputPort
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>new(type)</code></td><td></td><td>create a new InputPort of type</td></tr>
<tr><td><code>string, variable read()</code></td><td></td><td>read from Port, returns a FlowStatus string and if data available a Variable</td></tr>
<tr><td><code>string read(variable)</code></td><td></td><td>read from Port and write result into Variable given. Returns FlowStatus</td></tr>
<tr><td><code>table info()</code></td><td></td><td>return a table containing information about this port</td></tr>
</tbody>
</table>


<p>
OuputPort
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>new(type)</code></td><td></td><td>create a new OutputPort of type</td></tr>
<tr><td><code>write(Variable)</code></td><td></td><td>write Variable to port</td></tr>
<tr><td><code>table info()</code></td><td></td><td>return a table containing information about this port</td></tr>
</tbody>
</table>


</div>

</div>
