lua/doc/MANUAL.org
** Property

   | Method                    | flag | description                                                             |
   |---------------------------+------+-------------------------------------------------------------------------|
   | =new(type)=               |      | create a new Property                                                   |
   | =Variable get()=          |      | return the Variable contained in this Property                          |
   | =bool set(Variable)=      |      | set the Property to the value in given Variable                         |
   | =string getName()=        |      | return the name of the property                                         |
   | =string getDescription()= |      | return the description of the property                                  |
   | =delete()=                |      | delete this property (remove it from any TaskContex before doing this!) |

** Service Interface

*** Service

   | Method                           | flag | description                                                    |
   |----------------------------------+------+----------------------------------------------------------------|
   | =string getName()=               |      | return Name of Service                                         |
   | =string doc()=                   |      | return documentation of this service                           |
   | =table getProviderNames()=       |      | return table of subservice names                               |
   | =table getOperationNames()=      |      | return table of names of operations of this service            |
   | =table getPortNames()=           |      | return table of names of ports of this service                 |
   | =provides(string)=               |      | return subservice with name specified by given string          |
   | =Operation getOperation(string)= |      | return operation specified by string name  of this service     |
   | =Port getPort(string)=           |      | return port specified by the given string name of this service |

*** ServiceRequester

   | Method                      | flag | description                                         |
   |-----------------------------+------+-----------------------------------------------------|
   | =string getRequestName()=   |      | return name of this service requester               |
   | =table getRequesterNames()= |      | return table of names of required subservices       |
   | =bool ready()=              |      | true if all operations are resolved                 |
   | =void disconnect()=         |      | disconnect from remote Service                      |
   | =requires(string)=          |      | return required subservice specified by string name |

*** Operation

    This object is only returned by =Service:getOperation=. It can
    also be called with the familiar =op(arg1, arg2)= syntax.

   | Method                                 | flag | description                                                        |
   |----------------------------------------+------+--------------------------------------------------------------------|
   | =res_type, arity, desc, argtab info()= |      | returns result type, arity, description and table of parameters    |
   | =Variable call(string, ...)=           |      | calls operation specified by string. additional args are passed on |
   | =SendHandle send(string, ...)=         |      | same as above, but =send= Operation and return SendHandle          |


** Miscellaneous
*** Logger

    The good old logger.

    | Method                 | flag | description                 |
    |------------------------+------+-----------------------------|
    | =setlevel(string)=     | F    | set the loglevel            |
    | =string getloglevel()= | F    | return the current loglevel |
    | =log(string, ...)=     | F    | log all (string) arguments  |

*** Service/Typekits/Types information

    | Method             | flag | description                                              |
    |--------------------+------+----------------------------------------------------------|
    | =table services()= | F    | returns a table of strings specifying the known services |
    | =table typekits()= | F    | returns a table of strings specifying the known typekits |
    | =table types()=    | F    | returns a table of strings specifying the known types    |


