lua/doc/MANUAL.html

<div id="outline-container-6_6" class="outline-3">
<h3 id="sec-6_6"><span class="section-number-3">6.6</span> Property </h3>
<div class="outline-text-3" id="text-6_6">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>new(type)</code></td><td></td><td>create a new Property</td></tr>
<tr><td><code>Variable get()</code></td><td></td><td>return the Variable contained in this Property</td></tr>
<tr><td><code>bool set(Variable)</code></td><td></td><td>set the Property to the value in given Variable</td></tr>
<tr><td><code>string getName()</code></td><td></td><td>return the name of the property</td></tr>
<tr><td><code>string getDescription()</code></td><td></td><td>return the description of the property</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6_7" class="outline-3">
<h3 id="sec-6_7"><span class="section-number-3">6.7</span> Service Interface </h3>
<div class="outline-text-3" id="text-6_7">



</div>

<div id="outline-container-6_7_1" class="outline-4">
<h4 id="sec-6_7_1"><span class="section-number-4">6.7.1</span> Service </h4>
<div class="outline-text-4" id="text-6_7_1">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>string getName()</code></td><td></td><td>return Name of Service</td></tr>
<tr><td><code>string doc()</code></td><td></td><td>return documentation of this service</td></tr>
<tr><td><code>table getProviderNames()</code></td><td></td><td>return table of subservice names</td></tr>
<tr><td><code>table getOperationNames()</code></td><td></td><td>return table of names of operations of this service</td></tr>
<tr><td><code>table getPortNames()</code></td><td></td><td>return table of names of ports of this service</td></tr>
<tr><td><code>provides(string)</code></td><td></td><td>return subservice with name specified by given string</td></tr>
<tr><td><code>Operation getOperation(string)</code></td><td></td><td>return operation specified by string name  of this service</td></tr>
<tr><td><code>Port getPort(string)</code></td><td></td><td>return port specified by the given string name of this service</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6_7_2" class="outline-4">
<h4 id="sec-6_7_2"><span class="section-number-4">6.7.2</span> ServiceRequester </h4>
<div class="outline-text-4" id="text-6_7_2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>string getRequestName()</code></td><td></td><td>return name of this service requester</td></tr>
<tr><td><code>table getRequesterNames()</code></td><td></td><td>return table of names of required subservices</td></tr>
<tr><td><code>bool ready()</code></td><td></td><td>true if all operations are resolved</td></tr>
<tr><td><code>void disconnect()</code></td><td></td><td>disconnect from remote Service</td></tr>
<tr><td><code>requires(string)</code></td><td></td><td>return required subservice specified by string name</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6_7_3" class="outline-4">
<h4 id="sec-6_7_3"><span class="section-number-4">6.7.3</span> Operation </h4>
<div class="outline-text-4" id="text-6_7_3">


<p>
This object is only returned by <code>Service:getOperation</code>. It can
also be called with the familiar <code>op(arg1, arg2)</code> syntax.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>res_type, arity, desc, argtab info()</code></td><td></td><td>returns result type, arity, description and table of parameters</td></tr>
<tr><td><code>Variable call(string, ...)</code></td><td></td><td>calls operation specified by string. additional args are passed on</td></tr>
<tr><td><code>SendHandle send(string, ...)</code></td><td></td><td>same as above, but <code>send</code> Operation and return SendHandle</td></tr>
</tbody>
</table>



</div>
</div>

</div>

<div id="outline-container-6_8" class="outline-3">
<h3 id="sec-6_8"><span class="section-number-3">6.8</span> Miscellaneous </h3>
<div class="outline-text-3" id="text-6_8">


</div>

<div id="outline-container-6_8_1" class="outline-4">
<h4 id="sec-6_8_1"><span class="section-number-4">6.8.1</span> Logger </h4>
<div class="outline-text-4" id="text-6_8_1">


<p>
The good old logger.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>setlevel(string)</code></td><td>F</td><td>set the loglevel</td></tr>
<tr><td><code>string getloglevel()</code></td><td>F</td><td>return the current loglevel</td></tr>
<tr><td><code>log(string, ...)</code></td><td>F</td><td>log all (string) arguments</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-6_8_2" class="outline-4">
<h4 id="sec-6_8_2"><span class="section-number-4">6.8.2</span> Service/Typekits/Types information </h4>
<div class="outline-text-4" id="text-6_8_2">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Method</th><th scope="col">flag</th><th scope="col">description</th></tr>
</thead>
<tbody>
<tr><td><code>table services()</code></td><td>F</td><td>returns a table of strings specifying the known services</td></tr>
<tr><td><code>table typekits()</code></td><td>F</td><td>returns a table of strings specifying the known typekits</td></tr>
<tr><td><code>table types()</code></td><td>F</td><td>returns a table of strings specifying the known types</td></tr>
</tbody>
</table>



</div>
</div>
</div>

</div>
