lua/doc/MANUAL.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> The rttlib convenience module </h2>
<div class="outline-text-2" id="text-7">

<p>This library adds some useful (mostly pretty printing) functions to
the standard objects. It is recommended to load it for all
applications by adding the following to scripts:
</p>
<p>
<code>require("rttlib")</code>
</p>

</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> how to add a pretty printer for a custom type </h3>
<div class="outline-text-3" id="text-7_1">


<p>
In short: write a function which accepts a lua table representation
of you data type and returns either a table or a string. Assign it
to <code>rttlib.pp_var.mytype</code>, where mytype is the value returned by
the <code>var:getType()</code> method. That's all!
</p>
<p>
<b>Quick example:</b> <code>ConnPolicy</code> type
</p>
<p>
(This is just an example. It has been done for this type already).
</p>
<p>
If you run it without loading <code>rttlib</code> printing a <code>ConnPolicy</code> will
look like this:
</p>



<pre class="example">./rttlua
Orocos RTTLua 1.0-beta1 (gnulinux)
&gt; return var.new("ConnPolicy")
{data_size=0,type=0,name_id="",init=false,pull=false,transport=0,lock_policy=2,size=0}
</pre>



<p>
This not too bad, but we would like to display the string
representation of the C++ enums <code>type</code> and <code>lock_policy</code>. So we
write a function&hellip;
</p>



<pre class="example">function ConnPolicy2tab(cp)
    if cp.type == 0 then cp.type = "DATA"
    elseif cp.type == 1 then cp.type = "BUFFER"
    else cp.type = tostring(cp.type) .. " (invalid!)" end

    if cp.lock_policy == 0 then cp.lock_policy = "UNSYNC"
    elseif cp.lock_policy == 1 then cp.lock_policy = "LOCKED"
    elseif cp.lock_policy == 2 then cp.lock_policy = "LOCK_FREE"
    else cp.lock_policy = tostring(cp.lock_policy) .. " (invalid!)" end
    return cp
end
</pre>



<p>
and add it to the <code>rttlib.var_pp</code> table of Variable formatters:
</p>



<pre class="example">rttlib.var_pp.ConnPolicy = ConnPolicy2tab
</pre>



<p>
now printing a <code>ConnPolicy</code> again calls our function and prints the
desired fields:
</p>



<pre class="example">&gt; return var.new("ConnPolicy")
{data_size=0,type="DATA",name_id="",init=false,pull=false,transport=0,lock_policy="LOCK_FREE",size=0}
&gt;
</pre>



</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Tips and tricks </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> rttlua init file <code>~/.rttlua</code> </h3>
<div class="outline-text-3" id="text-8_1">


<p>
<code>rttlua</code> will look for a file <code>.rttlua</code> in your home directory and
if found execute it. It can be used for doing initalization
(e.g. loading <code>rttlib</code> etc.)
</p>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Known issues </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9_1" class="outline-3">
<h3 id="sec-9_1"><span class="section-number-3">9.1</span> Assignment is not like RTT scripting </h3>
<div class="outline-text-3" id="text-9_1">


<p>
Except for the Lua primitive types (string, number, boolean) Lua
works with references. So assignment between RTT Variables and Lua
types might not do what you expect:
</p>



<pre class="example">&gt; s=rtt.Variable.new("string", "hello world")
&gt; print(s)
hello world
&gt; =type(s)
userdata
&gt; =s:getType()
string
&gt; s = "a new string" -- carful! now its a Lua string, the former Variable will be garbage collected.
&gt; =type(s)
string
&gt; s:getType()
stdin:1: attempt to call method 'getType' (a nil value)
stack traceback:
stdin:1: in main chunk
</pre>



</div>

</div>

<div id="outline-container-9_2" class="outline-3">
<h3 id="sec-9_2"><span class="section-number-3">9.2</span> Not all types are garbage collected </h3>
<div class="outline-text-3" id="text-9_2">

</div>

</div>

<div id="outline-container-ComparisonIssue" class="outline-3">
<h3 id="ComparisonIssue"><a name="sec-9_3" id="sec-9_3"></a><span class="section-number-3">9.3</span> Comparing Lua types and RTT Variables fails </h3>
<div class="outline-text-3" id="text-ComparisonIssue">


<p>
Comparison of equivalent Lua and RTT Variable types is does <b>not</b>
work. You can only compare entities of the <span style="text-decoration:underline;">same</span> type:
</p>



<pre class="example">-- lua with lua works:
&gt; ="just a string" == "just a string"
true
-- and rtt.Variable with rtt.Variable too...
&gt; return rtt.Variable.new("string", "just a string") == rtt.Variable.new("string", "just a string")
true
-- but unfortunately not a mixture of both:
&gt; return "just a string" == rtt.Variable.new("string", "just a string")
false
</pre>



<ul>
<li>
It is currently not possible to call or send a connected local
required Operation.

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Todo  </h2>
<div class="outline-text-2" id="text-10">


<ul>
<li>
Support for creating Operations from Lua (probably not soon)

</li>
<li>
Calling a Connected Required Operation is not possible from Lua
right now.

</li>
</ul>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> License </h2>
<div class="outline-text-2" id="text-11">


<p>
The Lua-RTT bindings are licensed under the same license as the
<a href="http://orocos.org/orocos/license">OROCOS RTT</a>.
</p>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Links </h2>
<div class="outline-text-2" id="text-12">

<ul>
<li>
<a href="http://www.lua.org/">The Lua website</a>
</li>
<li>
<a href="http://www.lua.org/pil/">Programming in Lua</a> book (older version, but the basics are mostly the same)
</li>
<li>
<a href="http://www.lua.org/manual/5.1/">The Lua-5.1 Reference Manual</a>
</li>
<li>
<a href="http://thomaslauer.com/download/luarefv51.pdf">Lua Cheatsheet</a>
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Markus Klotzbuecher
</p>
<p class="date"> Date: 2010-09-13 Mon</p>
<p class="creator">HTML generated by org-mode TAG=7.01g in emacs 23</p>
</div>
</div>
</body>
</html>
