lua/doc/MANUAL.txt


7 The rttlib convenience module 
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
  This library adds some useful (mostly pretty printing) functions to
  the standard objects. It is recommended to load it for all
  applications by adding the following to scripts:

  =require("rttlib")=

7.1 how to add a pretty printer for a custom type 
==================================================

   In short: write a function which accepts a lua table representation
   of you data type and returns either a table or a string. Assign it
   to =rttlib.pp_var.mytype=, where mytype is the value returned by
   the =var:getType()= method. That's all!

   *Quick example:* =ConnPolicy= type

   (This is just an example. It has been done for this type already).

   If you run it without loading =rttlib= printing a =ConnPolicy= will
   look like this:


  ./rttlua
  Orocos RTTLua 1.0-beta1 (gnulinux)
  > return var.new("ConnPolicy")
  {data_size=0,type=0,name_id="",init=false,pull=false,transport=0,lock_policy=2,size=0}

   This not too bad, but we would like to display the string
   representation of the C++ enums =type= and =lock_policy=. So we
   write a function...


  function ConnPolicy2tab(cp)
      if cp.type == 0 then cp.type = "DATA"
      elseif cp.type == 1 then cp.type = "BUFFER"
      else cp.type = tostring(cp.type) .. " (invalid!)" end
  
      if cp.lock_policy == 0 then cp.lock_policy = "UNSYNC"
      elseif cp.lock_policy == 1 then cp.lock_policy = "LOCKED"
      elseif cp.lock_policy == 2 then cp.lock_policy = "LOCK_FREE"
      else cp.lock_policy = tostring(cp.lock_policy) .. " (invalid!)" end
      return cp
  end

   and add it to the =rttlib.var_pp= table of Variable formatters:


  rttlib.var_pp.ConnPolicy = ConnPolicy2tab

   now printing a =ConnPolicy= again calls our function and prints the
   desired fields:


  > return var.new("ConnPolicy")
  {data_size=0,type="DATA",name_id="",init=false,pull=false,transport=0,lock_policy="LOCK_FREE",size=0}
  >

8 Tips and tricks 
~~~~~~~~~~~~~~~~~~

8.1 rttlua init file =~/.rttlua= 
=================================

   =rttlua= will look for a file =.rttlua= in your home directory and
   if found execute it. It can be used for doing initalization
   (e.g. loading =rttlib= etc.)

9 Known issues 
~~~~~~~~~~~~~~~

9.1 Assignment is not like RTT scripting 
=========================================

   Except for the Lua primitive types (string, number, boolean) Lua
   works with references. So assignment between RTT Variables and Lua
   types might not do what you expect:


  > s=rtt.Variable.new("string", "hello world")
  > print(s)
  hello world
  > =type(s)
  userdata
  > =s:getType()
  string
  > s = "a new string" -- carful! now its a Lua string, the former Variable will be garbage collected.
  > =type(s)
  string
  > s:getType()
  stdin:1: attempt to call method 'getType' (a nil value)
  stack traceback:
  stdin:1: in main chunk

9.2 Not all types are garbage collected 
========================================

9.3 Comparing Lua types and RTT Variables fails 
================================================

   Comparison of equivalent Lua and RTT Variable types is does *not*
   work. You can only compare entities of the _same_ type:


  -- lua with lua works:
  > ="just a string" == "just a string"
  true
  -- and rtt.Variable with rtt.Variable too...
  > return rtt.Variable.new("string", "just a string") == rtt.Variable.new("string", "just a string")
  true
  -- but unfortunately not a mixture of both:
  > return "just a string" == rtt.Variable.new("string", "just a string")
  false

   - It is currently not possible to call or send a connected local
     required Operation.

10 Todo  
~~~~~~~~~

  - Support for creating Operations from Lua (probably not soon)

  - Calling a Connected Required Operation is not possible from Lua
    right now.

11 License 
~~~~~~~~~~~

  The Lua-RTT bindings are licensed under the same license as the
  [OROCOS RTT].


  [OROCOS RTT]: http://orocos.org/orocos/license

12 Links 
~~~~~~~~~
  - [The Lua website]
  - [Programming in Lua] book (older version, but the basics are mostly the same)
  - [The Lua-5.1 Reference Manual]
  - [Lua Cheatsheet]

  [The Lua website]: http://www.lua.org/
  [Programming in Lua]: http://www.lua.org/pil/
  [The Lua-5.1 Reference Manual]: http://www.lua.org/manual/5.1/
  [Lua Cheatsheet]: http://thomaslauer.com/download/luarefv51.pdf

